// --------------- imports ---------------
import { catigirizer } from "./fun.js";
import { validWordsObj } from "./validWords.js";
// --------------- imports ---------------

export const guessWordsObj = {
    occupations: { 5: [], 6: [], 7: [], 8: [] },
    countries: {
        5: [],
        6: [],
        7: [],
        8: [],
    },
    capitals: { 5: [], 6: [], 7: [], 8: [] },
    food: {
        5: [],
        6: [],
        7: [],
        8: [],
    },
    animals: {
        5: [],
        6: [],
        7: [],
        8: [],
    },
    randomChoice() {
        const randomNumber = randomNumber();

        let guessWordCounter = Math.round(
            Math.random() * validWordsObj[randomNumber].length
        );

        let guessWord = validWordsObj[randomNumber][guessWordCounter];
        let guessWordLength = guessWord.length;

        return {
            randomNumber,
            guessWordCounter,
            guessWordLength,
        };
    },
};

// occupations
const occupations = {
    raw: "مامۆستا _،_ فیتەر _،_ بۆیاخچی _،_ سایەق _،_ نانەوا _،_ قەساب _،_ دارتاش _،_ حەرەس _،_ بەڕێوبەر _،_ زمانناس _،_ دانساز _،_ ئاسنگەر _،_ دادوەر _،_ پارێزەر _،_ سەرباز _،_ سەرۆک _،_ وەزیر _،_ کرێکار _،_ پینەچی _،_ کەنناس _،_ فەلاق _،_ دوکاندار _،_ فرۆشیار _،_ مەندووب _،_ گارسۆن _،_ مردووشۆر _،_ مۆنتێر _،_ ئێدیتەر _،_ پەیامنێر _،_ وتاربێژ _،_ نووسەر _،_ شاعیر _،_ ڕەخنەگر _،_ پڕۆفیسۆر _،_ فەڕاش _،_ خوێندکار _،_ کارەکەر _،_ خزمەتکار _،_ کلیلساز _،_ جامچی _،_ قاچاخچی _،_ شووشەبڕ _،_ کاپتن _،_ ژمێریار _،_ مەعرەزچی _،_ سواڵکەر _،_ جوتیار _،_ چایچی _،_ زەڕەنگەر _،_ ڕاوچی _،_ شاگرد _،_ وێنەگر _،_ ڤڵۆگەر _،_ یوتیوبەر _،_ فاڵچی _،_ فڕۆکەوان _،_ باخەوان _،_ بەندبێژ _،_ بێژەر _،_ خەیات _،_ مێژووناس _،_ دەرگاوان _،_ دیزاینەر _،_ شێوەکار _،_ شانۆکار _،_ ئاکتەر _،_ وەرگێڕ _،_ وانەبێژ _،_ دایەن _،_ ئەفسەر _،_ کاشێر _،_ مڕووج _،_ دیلیڤەری _،_ وێنەکێش _،_ لەحیمچی _،_ کارەباچی _،_ لێکۆڵەر _،_ شانۆنووس _،_ پەرستار _،_ باریستە _،_ سایەقپاس _،_ ڕۆنگۆڕ _،_ وایەرمەن _،_ تەلارساز _،_ دیپلۆمات _،_ ڕاوێژکار _،_ سکرتێر _،_ بەقاڵ _،_ پێشمەرگە _،_ مروور _،_ بوککیپەر _،_ دکتۆر _،_ گوڵفرۆش _،_ ماسیگر _،_ هەواڵبێژ _،_ سەماکار _،_ پۆستەچی _،_ کەشتیوان _،_ گاوان _،_ جەڕاح _،_ نەخاڕ _،_ هەنگەوان _،_ شاخەوان _،_ مەلەوان _،_ گۆزەچی _،_ ئەکتەر _،_ نووسە _،_ دەرهێنەر _،_ حەڵواچی _،_ قاوەچی _،_ ڕاهێنەر _،_ مەندوب _،_ موحاسیب _،_ حەماڵ _،_ خەلفە _،_ وەستا _،_ گونکبڕ _،_ کوێخا _،_ موختار _،_ جادووگەر _،_ زوڕناچی _،_ خۆشنووس _،_ مەیتەر _،_ بەرگدروو _،_ گەوواد _،_ ئەفەندی _،_ گەڕیدە _،_ حەلاج _،_ پەنچەرچی _،_ کوشنچی _،_ کەبابچی _،_ عەداد",
};
catigirizer(occupations, guessWordsObj.occupations);

// countries
const countries = {
    raw: "ئەلبانیا _،_ جەزائیر _،_ ساموا _،_ ئەندۆرا _،_ ئەنگۆلا _،_ ئەنگۆلیا _،_ ئەنتیگوا _،_ باربودا _،_ ئەرمینیا _،_ ئاروبا _،_ ئۆستریا _،_ باهامەس _،_ بەحرەین _،_ باڕبادۆس _،_ بێلاڕوس _،_ بەلجیکا _،_ بەڵیز _،_ بێنین _،_ بەرمۆدا _،_ بوتان _،_ بۆڵیڤیا _،_ بۆسنە _،_ بۆتسونا _،_ بەڕازیل _،_ برونی _،_ بولگاریا _،_ بوروندی _،_ کەمبۆدیا _،_ کامیرۆن _،_ کەنەدا _،_ کاپڤێرت _،_ کۆکۆس _،_ کۆڵۆمبیا _،_ کۆمۆریس _،_ کۆنگۆ _،_ کرواتیا _،_ کووبا _،_ کیپریس _،_ دانیمارک _،_ دیبۆتی _،_ دۆمەنیکا _،_ ئیستیمۆر _،_ ئیکوادۆر _،_ ئەریتریا _،_ ئیستۆنیا _،_ ئیسیۆپیا _،_ فۆلکلاند _،_ فینلەندا _،_ فەڕەنسا _،_ گۆبۆن _،_ گامبیا _،_ جۆرجیا _،_ ئەڵمانیا _،_ یۆنان _،_ گرینلاند _،_ گرینادا _،_ گیانا _،_ هەیتی _،_ هیندۆڕاس _،_ هەنگاریا _،_ هۆنگکۆنگ _،_ هیندستان _،_ ئایسلاند _،_ ئێران _،_ عێراق _،_ ئیرلەندا _،_ ئیسڕائیل _،_ ئیتالیا _،_ جامایکا _،_ ژاپۆن _،_ عەممان _،_ کینیا _،_ کیریباتی _،_ کۆسۆڤۆ _،_ کووەیت _،_ لاتیڤیا _،_ لوبنان _،_ لیسۆسۆ _،_ لیبێریا _،_ لیبیا _،_ لیتوانیا _،_ مالاوی _،_ مالیزیا _،_ ماڵتا _،_ مارتینیک _،_ مۆریتاس _،_ مایۆتی _،_ مەکسیک _،_ ماڵدۆڤا _،_ مۆناکۆ _،_ مەنگۆلیا _،_ مەغریب _،_ مۆزەمبیق _،_ میانمار _،_ نامبیا _،_ ناورۆ _،_ نیپاڵ _،_ هۆڵندا _،_ نێجیر _،_ نێجیریا _،_ مەکدۆنیا _،_ نەرویج _،_ عوممان _،_ پاکستان _،_ پاولۆ _،_ فەڵەستین _،_ پەنەما _،_ پاپوا _،_ پاراگوای _،_ فلیپین _،_ پۆڵندا _،_ پورتوگال _،_ ئیسپانیا _،_ قەتەر _،_ ڕۆمانیا _،_ ڕوسیا _،_ ڕواندا _،_ سانکیتس _،_ سانلوسیا _،_ سعودیە _،_ سەنیگال _،_ سڕبیا _،_ سیرالۆن _،_ سلۆڤاکیا _،_ سلۆڤینیا _،_ سۆمال _،_ سوودان _،_ سریلانکا _،_ سورینام _،_ سویسرا _،_ سووریا _،_ تایوان _،_ تەنزانیا _،_ تۆنگۆ _،_ تۆکیلاو _،_ تۆنگا _،_ ترینیداد _،_ توونس _،_ تورکیا _،_ توڤالۆ _،_ ئۆگەندا _،_ ئۆکرانیا _،_ ئیماران _،_ ئەمریکا _،_ ئۆرۆگوای _،_ ڤانواتۆ _،_ ڤاتیکان _،_ ڤەنزوێلا _،_ ڤێتنام _،_ ساحارا _،_ یەمەن _،_ زامبیا",
};
catigirizer(countries, guessWordsObj.countries);

// capitals
const capitals = {
    raw: "",
};
catigirizer(capitals, guessWordsObj.capitals);

// food
const food = {
    raw: "تەڕەتیزە _،_ کەلەرم _،_ شوویت _،_ تەڕەپیاز _،_ گۆزروان _،_ زەڵاتە _،_ هەنار _،_ هەرمێ _،_ بادەم _،_ گوێزهندی _،_ دۆخەوا _،_ بریانی _،_ ساوەر _،_ نیسکێنە _،_ نیسکێن _،_ هەمبەرگر _،_ فەلافل _،_ یاپراخ _،_ نیشاستە _،_ لیمەدۆزی _،_ ئاولیمۆ _،_ فاسۆلیا _،_ نۆکاو _،_ دانوولە _،_ قارچک _،_ بەهارات _،_ برژاو _،_ کەباب _،_ شیرینی _،_ پانکێک _،_ مەقلووبە _،_ باینجان _،_ نیسکافە _،_ سپاگێتی _،_ مایەنیز _،_ هۆتدۆگ _،_ فینگەر _،_ کاپوچینۆ _،_ شەربەت _،_ بەڕوو _،_ شیعری _،_ شاورمە _،_ کشمیش _،_ گێزەر _،_ پەنیز _،_ مریشک _،_ ڕۆبیان _،_ خورما _،_ دۆنەت _،_ کولاو _،_ ئایسکرێم _،_ چلوورە _،_ قەیسی _،_ هەنگوین _،_ ترۆزی _،_ خەیار _،_ شووتی _،_ گاڵەک _،_ کەچەپ _،_ میڵکشەیک _،_ پیتزا _،_ پێپەرۆنی _،_ سپێناخ _،_ سپێناغ _،_ بایەم _،_ ماستاو _،_ ئاڤۆکادۆ _،_ سەموون _،_ کولێرە _،_ ترخێنە _،_ تەڕەماش _،_ تەڕەساز _،_ شوکلاتە _،_ چوکلێت _،_ شێخمەعشی _،_ شیلیک _،_ بیبەر _،_ لاتێی _،_ پرتەقاڵ _،_ ئاناناس _،_ ئەنەناس _،_ بەرسیلە _،_ شوییت _،_ بڕۆکلی _،_ شۆربا _،_ کۆکتێل _،_ هەنجیر _،_ ئێسپرێسۆ _،_ مرەبا _،_ قەیماغ _،_ پەتاتە _،_ تەماتە _،_ هەڵووژە _،_ زەیتوون _،_ کوولەکە _،_ تووتڕک _،_ سووشی _،_ سالمۆن _،_ قرژانگ _،_ شلییک _،_ لالەنگی _،_ پاستا _،_ چەرەس _،_ شەوچەرە _،_ ساندوچ _،_ تورتە _،_ پێپسی _،_ شامپانیا _،_ دارچینی _،_ ڤانیلا _،_ خومرە _،_ بۆرەک _،_ شرووب _،_ تەرخوون _،_ کەوەر _،_ کەرەوز _،_ کاهوو _،_ دوومەڵان _،_ ترشەسماق _،_ شەمامە _،_ چەڵتووک _،_ دۆڵمە _،_ سەروپێ _،_ دۆندرمە _،_ ڕێواس _،_ پاقلە _،_ گندۆرە",
};
catigirizer(food, guessWordsObj.food);

// food
const animals = {
    raw: "پڵینگ _،_ کەمتیار _،_ مانگا _،_ گوێرەکە _،_ گوێدرێژ _،_ هێستر _،_ ئێستر _،_ مایین _،_ مراوی _،_ کەرەکێوی _،_ ڕۆبیان _،_ پشیلە _،_ تانجی _،_ چۆلەکە _،_ مەیموون _،_ کەنغەر _،_ کەرکەدەن _،_ سمۆرە _،_ شەوگەڕ _،_ شەوگەرد _،_ دووپشک _،_ ڕاکۆن _،_ زەڕافە _،_ پاندا _،_ حەربا _،_ کوالا _،_ سامپانزی _،_ گامێش _،_ غۆرێلا _،_ تووتی _،_ تیمساح _،_ پەنگیون _،_ تاووس _،_ نەهەنگ _،_ نەعامە _،_ قربۆق _،_ پەپوولە _،_ کوللە _،_ گوورگ _،_ بەراز _،_ کەروێشک _،_ بەران _،_ قرژنگ _،_ قرژاڵ _،_ سووچڕ _،_ جووجک _،_ مریشک _،_ کەڵەشێر _،_ حوشتر _،_ کیسەڵ _،_ ماسیگرە _،_ نەورەس _،_ قەقنەس _،_ بوولبوول _،_ کەناری _،_ ڕیشۆڵە _،_ قەلەڕەش _،_ قشقەڕە _،_ عەلەشیش _،_ کۆکتێل _،_ غەندوور",
};
catigirizer(animals, guessWordsObj.animals);

// random
const random = {
    random: "",
};
